fa-xbrl/src/Documents/velpo_Fact/velpo_Fact.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>velpo_Fact</name>
  <registerRecords>AccountingRegister.velpo_MeasureEntries</registerRecords>
  <registerRecords>AccountingRegister.velpo_InfoEntries</registerRecords>
  <attributes>
    <name>Component</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.velpo_BusinessUnits</types>
    </type>
  </attributes>
</mdclass:Document>

fa-xbrl/src/Documents/velpo_Fact/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// FA-XBRL, Bookkeeping and XBRL proccessor
//
// @author: Paul Tarasov
//	@email: paul.tarasov@velpo.ru
// 
// Copyright (c) 2021 Paul Tarasov (Velpo)
///////////////////////////////////////////////////////////////////////////////////////////////////////

Function Create(BeginOfPeriod = Undefined, EndOfPeriod, BusinessUnit, Component = Undefined, SourceDocument = Undefined) Export

	DocObject = Documents.velpo_Fact.CreateDocument();
	DocObject.BeginOfPeriod = BegOfDay(BeginOfPeriod);
	DocObject.Date = EndOfDay(EndOfPeriod);
	DocObject.BusinessUnit = BusinessUnit;
	DocObject.Component = Component;
	DocObject.SourceDocument = SourceDocument;
	DocObject.PointOfChange = CurrentUniversalDateInMilliseconds();
	DocObject.Write(DocumentWriteMode.Posting);
	
	Return DocObject;
	
EndFunction // Create()
